[
    {
        "id" : 1,
        "img" : "https://upload.wikimedia.org/wikipedia/en/0/02/Iron_Man_%282008_film%29_poster.jpg",
        "title" : "Iron Man",
        "usReleaseDate": 2008,
        "worldReleaseDate": 2008,
        "director" : "Jon Favreau",
        "screenwriter" : "Mark Fergus, Hawk Ostby, Art Marcum, Matt Holloway",
        "producer" : "Avi Arad, Kevin Feige",
        "phase" : 1,
        "plot":"Tony Stark, who has inherited the defense contractor Stark Industries from his late father Howard Stark, is in war-torn Afghanistan with his friend and military liaison, Lieutenant colonel James Rhodes, to demonstrate the new 'Jericho' missile.",
        "movieLength":126,
        "stars":"Robert Downey Jr., Terrence Howard, Jeff Bridges,  Shaun Toub, Gwyneth Paltrow"
        
    },
    {
        "id" : 2,
        "img" : "https://upload.wikimedia.org/wikipedia/en/f/f0/The_Incredible_Hulk_%28film%29_poster.jpg",
        "title" : "The Incredible Hulk",
        "usReleaseDate": 2008,
        "worldReleaseDate": 2008,
        "director" : "Louis Leterrier",
        "screenwriter" : "Zak Penn",
        "producer" : "Avi Arad, Kevin Feige, Gale Anne Hurd",
        "phase" : 1,
        "plot":"At Culver University in Virginia, General Thaddeus 'Thunderbolt' Ross meets with Dr. Bruce Banner, the colleague and boyfriend of his daughter Betty, regarding an experiment that Ross claims is meant to make humans immune to gamma radiation.",
        "movieLength":112,
        "stars":"Edward Norton, Liv Tyler, Tim Roth, Tim Blake Nelson, Ty Burrell, William Hurt"
    },
    {
        "id" : 3,
        "img" : "https://upload.wikimedia.org/wikipedia/en/e/ed/Iron_Man_2_poster.jpg",
        "title" : "Iron Man 2",
        "usReleaseDate": 2010,
        "worldReleaseDate": 2010,
        "director" : "Jon Favreau",
        "screenwriter" : "Justin Theroux",
        "producer" : "Kevin Feige",
        "phase" : 1,
        "plot":"In Russia, the media covers Tony Stark's disclosure of his identity as Iron Man. Ivan Vanko, whose father, Anton Vanko, a former Stark Industries employee, has just died, sees this and begins building a miniature arc reactor similar to Stark's.",
        "movieLength":125,
        "stars":"Robert Downey Jr., Gwyneth Paltrow, Don Cheadle, Scarlett Johansson, Sam Rockwell, Mickey Rourke, Samuel L. Jackson"
    },
    {
        "id" : 4,
        "img" : "https://upload.wikimedia.org/wikipedia/en/9/95/Thor_%28film%29_poster.jpg",
        "title" : "Thor",
        "usReleaseDate": 2011,
        "worldReleaseDate": 2011,
        "director" : "Kenneth Branagh",
        "screenwriter" : "Ashley Edward Miller, Zack Stentz, Don Payne",
        "producer" : "Kevin Feige",
        "phase" : 1,
        "plot":"In 965 AD, Odin, king of Asgard, wages war against the Frost Giants of Jotunheim and their leader Laufey, to prevent them from conquering the Nine Realms, starting with Earth. The Asgardian warriors defeat the Frost Giants in Tønsberg, Norway, and seize the source of their power, the Casket of Ancient Winters.",
        "movieLength":114,
        "stars":"Chris Hemsworth, Natalie Portman, Tom Hiddleston, Stellan Skarsgård, Colm Feore, Ray Stevenson, Idris Elba, Kat Dennings, Rene Russo, Anthony Hopkins"
    },
    {
        "id" : 5,
        "img" : "https://upload.wikimedia.org/wikipedia/en/3/37/Captain_America_The_First_Avenger_poster.jpg",
        "title" : "Captain America: The First Avenger",
        "usReleaseDate": 2011,
        "worldReleaseDate": 2011,
        "director" : "Joe Johnston",
        "screenwriter" : "Christopher Markus, Stephen McFeely",
        "producer" : "Kevin Feige",
        "phase" : 1,
        "plot":"In the present day, scientists in the Arctic uncover an old, frozen aircraft. In March 1942, Nazi lieutenant general Johann Schmidt and his men steal a mysterious relic called the Tesseract,[N 2] which possesses untold godly powers, from the town of Tønsberg in German-occupied Norway.",
        "movieLength":124,
        "stars":"Chris Evans, Tommy Lee Jones, Hugo Weaving, Hayley Atwell, Sebastian Stan, Dominic Cooper, Neal McDonough, Derek Luke, Stanley Tucci"
    },
    {
        "id" : 6,
        "img" : "https://upload.wikimedia.org/wikipedia/en/8/8a/The_Avengers_%282012_film%29_poster.jpg",
        "title" : "Marvel's The Avengers",
        "usReleaseDate": 2012,
        "worldReleaseDate": 2012,
        "director" : "Joss Whedon",
        "screenwriter" : "Joss Whedon",
        "producer" : "Kevin Feige",
        "phase" : 1,
        "plot":"The Asgardian Loki encounters the Other, the leader of an extraterrestrial race known as the Chitauri. In exchange for retrieving the Tesseract,[N 2] a powerful energy source of unknown potential, the Other promises Loki an army with which he can subjugate Earth. Nick Fury, director of the espionage agency S.H.I.E.L.D., arrives at a remote research facility, where physicist Dr. Erik Selvig is leading a team experimenting on the Tesseract. The Tesseract suddenly activates and opens a wormhole, allowing Loki to reach Earth. Loki steals the Tesseract and uses his scepter to enslave Selvig and other agents, including Clint Barton, to aid him.",
        "movieLength":143,
        "stars":"Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Tom Hiddleston, Clark Gregg, Cobie Smulders, Stellan Skarsgård, Samuel L. Jackson"
    },
    {
        "id" : 7,
        "img" : "https://upload.wikimedia.org/wikipedia/en/1/19/Iron_Man_3_poster.jpg",
        "title" : "Iron Man 3",
        "usReleaseDate": 2013,
        "worldReleaseDate": 2013,
        "director" : "Shane Black",
        "screenwriter" : "Shane Black",
        "producer" : "Kevin Feige",
        "phase" : 2,
        "plot":"At a New Year's Eve party in 1999, Tony Stark meets scientist Maya Hansen, the inventor of an experimental regenerative treatment named Extremis that allows recovery from crippling injuries. Disabled scientist Aldrich Killian offers them a place in his company Advanced Idea Mechanics, but Stark rejects him. In December 2012, seven months after the Battle of New York, Stark is suffering from post-traumatic stress disorder and is having frequent panic and anxiety attacks due to his experiences during the alien invasion and subsequent battle.[N 2] Restless, he has built dozens of new Iron Man suits to cope with his insomnia, creating friction with his girlfriend Pepper Potts.",
        "movieLength":131,
        "stars":"Robert Downey Jr., Gwyneth Paltrow, Don Cheadle, Guy Pearce, Rebecca Hall, Stéphanie Szostak, James Badge Dale, Jon Favreau, Ben Kingsley"
    },
    {
        "id" : 8,
        "img" : "https://upload.wikimedia.org/wikipedia/en/7/7f/Thor_The_Dark_World_poster.jpg",
        "title" : "Thor The Dark World",
        "usReleaseDate": 2013,
        "worldReleaseDate": 2013,
        "director" : "Alan Taylor",
        "screenwriter" : "Christopher Yost, Christopher Markus, Stephen McFeely",
        "producer" : "Kevin Feige",
        "phase" : 2,
        "plot":"Eons ago, Bor, father of Odin, clashes with the Dark Elf Malekith, who seeks to unleash a weapon known as the Aether on the nine realms. After conquering Malekith's forces, including enhanced warriors called the Kursed, on their home world of Svartalfheim, Bor safeguards the Aether within a stone column. Unknown to Bor, Malekith and a handful of Dark Elves escape into suspended animation.",
        "movieLength":112,
        "stars":"Chris Hemsworth, Natalie Portman, Tom Hiddleston, Anthony Hopkins, Stellan Skarsgård, Idris Elba, Christopher Eccleston, Adewale Akinnuoye-Agbaje, Kat Dennings, Ray Stevenson, Zachary Levi, Tadanobu Asano, Jaimie Alexander, Rene Russo"
    },
    {
        "id" : 9,
        "img" : "https://upload.wikimedia.org/wikipedia/en/9/9e/Captain_America_The_Winter_Soldier_poster.jpg",
        "title" : "Captain America: The Winter Soldier",
        "usReleaseDate": 2014,
        "worldReleaseDate": 2014,
        "director" : "Anthony Russo, Joe Russo",
        "screenwriter" : "Christopher Markus, Stephen McFeely",
        "producer" : "Kevin Feige",
        "phase" : 2,
        "plot":"Two years after the Battle of New York,[N 1] Steve Rogers works in Washington, D.C., for the espionage agency S.H.I.E.L.D., while adjusting to contemporary society. During a mission alongside Agent Natasha Romanoff and S.H.I.E.L.D.'s counter-terrorism S.T.R.I.K.E. team, led by Agent Brock Rumlow, to free hostages aboard a S.H.I.E.L.D. vessel from pirates led by Georges Batroc, Rogers discovers Romanoff has another agenda: to extract data from the ship's computers. Returning to the Triskelion, S.H.I.E.L.D.'s headquarters, Rogers confronts Director Nick Fury and is briefed about Project Insight: three Helicarriers linked to spy satellites, designed to preemptively eliminate threats. Unable to decrypt Romanoff's data, Fury becomes suspicious about Insight and asks senior S.H.I.E.L.D. official and Secretary of Internal Security Alexander Pierce to delay the project.",
        "movieLength":136,
        "stars":"Chris Evans, Scarlett Johansson, Sebastian Stan, Anthony Mackie, Cobie Smulders, Frank Grillo, Emily VanCamp, Hayley Atwell, Robert Redford, Samuel L. Jackson"
    },
    {
        "id" : 10,
        "img" : "https://upload.wikimedia.org/wikipedia/en/3/33/Guardians_of_the_Galaxy_%28film%29_poster.jpg",
        "title" : "Guardians of the Galaxy",
        "usReleaseDate": 2014,
        "worldReleaseDate": 2014,
        "director" : "James Gunn",
        "screenwriter" : "James Gunn",
        "producer" : "Kevin Feige",
        "phase" : 2,
        "plot":"In 1988, following his mother's death, a young Peter Quill is abducted from Earth by a group of alien thieves and smugglers called the Ravagers led by Yondu Udonta. In 2014, on the abandoned planet Morag, Quill steals a mysterious Orb, but is attacked by forces of the fanatical Kree renegade Ronan the Accuser led by Korath. Although Quill escapes with the Orb, Yondu discovers his theft and issues a bounty for his capture, while Ronan sends the assassin Gamora after the Orb.",
        "movieLength":122,
        "stars": "Chris Pratt, Zoe Saldaña, Dave Bautista, Vin Diesel, Bradley Cooper, Lee Pace, Michael Rooker, Karen Gillan, Djimon Hounsou, John C. Reilly, Glenn Close, Benicio del Toro"
    },
    {
        "id" : 11,
        "img" : "https://upload.wikimedia.org/wikipedia/en/f/ff/Avengers_Age_of_Ultron_poster.jpg",
        "title" : "Avengers: Age of Ultron",
        "usReleaseDate": 2015,
        "worldReleaseDate": 2015,
        "director" : "Joss Whedon",
        "screenwriter" : "Joss Whedon",
        "producer" : "Kevin Feige",
        "phase" : 2,
        "plot":"In the Eastern European country of Sokovia, the Avengers—Tony Stark, Steve Rogers, Thor, Bruce Banner, Natasha Romanoff, and Clint Barton—raid a Hydra facility commanded by Baron Wolfgang von Strucker, who has experimented on humans using the scepter previously wielded by Loki. They meet two of Strucker's test subjects—twins Pietro (who has superhuman speed) and Wanda Maximoff (who has telepathic and telekinetic abilities)—and apprehend Strucker, while Stark retrieves Loki's scepter.",
        "movieLength":141,
        "stars" : "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Jeremy Renner, Don Cheadle, Aaron Taylor-Johnson, Elizabeth Olsen, Paul Bettany, Cobie Smulders, Anthony Mackie, Hayley Atwell, Idris Elba, Stellan Skarsgård, James Spader, Samuel L. Jackson"
    },
    {
        "id" : 12,
        "img" : "https://upload.wikimedia.org/wikipedia/en/1/12/Ant-Man_%28film%29_poster.jpg",
        "title" : "Ant-Man",
        "usReleaseDate": 2015,
        "worldReleaseDate": 2015,
        "director" : "Peyton Reed",
        "screenwriter" : "Edgar Wright, Joe Cornish, Adam McKay, Paul Rudd",
        "producer" : "Kevin Feige",
        "phase" : 2,
        "plot":"In 1989, scientist Hank Pym resigns from S.H.I.E.L.D. after discovering their attempt to replicate his Ant-Man shrinking technology. Believing the technology would be dangerous if replicated, Pym vows to hide it for as long as he lives. In the present day,[N 1] Pym's estranged daughter, Hope van Dyne, and former protégé, Darren Cross, have forced him out of his company, Pym Technologies. Cross is close to perfecting a shrinking suit of his own, the Yellowjacket, which horrifies Pym.",
        "movieLength":117,
        "stars" :"Paul Rudd, Evangeline Lilly, Corey Stoll, Bobby Cannavale, Michael Peña, Tip 'T.I.' Harris, Anthony Mackie, Wood Harris, Judy Greer, David Dastmalchian, Michael Douglas"
    },
    {
        "id" : 13,
        "img" : "https://upload.wikimedia.org/wikipedia/en/5/53/Captain_America_Civil_War_poster.jpg",
        "title" : "Captain America: Civil War",
        "usReleaseDate": 2016,
        "worldReleaseDate": 2016,
        "director" : "Anthony Russo, Joe Russo",
        "screenwriter" : "Christopher Markus, Stephen McFeely",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"In 1991, the brainwashed super-soldier James 'Bucky' Barnes is dispatched from a Hydra base in Siberia to intercept an automobile carrying a case of super-soldier serum. In the present day, approximately one year after Ultron is defeated by the Avengers in the nation of Sokovia,[N 1] Steve Rogers, Natasha Romanoff, Sam Wilson, and Wanda Maximoff stop Brock Rumlow from stealing a biological weapon from a lab in Lagos. Rumlow blows himself up, attempting to kill Rogers. Maximoff telekinetically diverts the explosion, accidentally destroying a nearby building and killing several Wakandan humanitarian workers in the process.",
        "movieLength":147,
        "stars" : "Chris Evans, Robert Downey Jr., Scarlett Johansson, Sebastian Stan, Anthony Mackie, Don Cheadle, Jeremy Renner, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Paul Rudd, Emily VanCamp, Tom Holland, Frank Grillo,  William Hurt, Daniel Brühl"
    },
    {
        "id" : 14,
        "img" : "https://upload.wikimedia.org/wikipedia/en/a/a1/Doctor_Strange_%282016_film%29_poster.jpg",
        "title" : "Doctor Strange",
        "usReleaseDate": 2016,
        "worldReleaseDate": 2016,
        "director" : "Scott Derrickson",
        "screenwriter" : "Jon Spaihts, Scott Derrickson,  C. Robert Cargill",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"In Kathmandu, the sorcerer Kaecilius and his zealots enter the secret compound Kamar-Taj and behead its librarian. They steal a few pages from an ancient, mystical text belonging to the Ancient One, a long-lived sorcerer who has taught every student at Kamar-Taj, including Kaecilius, in the mystic arts. The Ancient One pursues the traitors, but Kaecilius and his followers escape.",
        "movieLength":115,
        "stars" : "Benedict Cumberbatch, Chiwetel Ejiofor, Rachel McAdams, Benedict Wong, Michael Stuhlbarg, Benjamin Bratt, Scott Adkins, Mads Mikkelsen, Tilda Swinton"
    },
    {
        "id" : 15,
        "img" : "https://upload.wikimedia.org/wikipedia/en/a/ab/Guardians_of_the_Galaxy_Vol_2_poster.jpg",
        "title" : "Guardians of the Galaxy Vol. 2",
        "usReleaseDate": 2017,
        "worldReleaseDate": 2017,
        "director" : "James Gunn",
        "screenwriter" : "James Gunn",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"In 2014, Peter Quill, Gamora, Drax, Rocket, and Baby Groot are renowned as the Guardians of the Galaxy. Ayesha, leader of the Sovereign race, has the Guardians protect valuable batteries from Abilisk, an inter-dimensional monster, in exchange for Gamora's estranged sister Nebula, who was caught attempting to steal the batteries. After Rocket steals the batteries for himself, the Sovereign attacks the Guardians' ship with a fleet of drones. A mysterious figure destroys the drones, and the Guardians crash-land on a nearby planet. There, this figure reveals himself as Quill's father, Ego, and invites Quill, Gamora, and Drax to his home planet. Rocket and Groot remain behind to repair the ship and guard Nebula.",
        "movieLength":137,
        "stars" : "Chris Pratt, Zoe Saldaña, Dave Bautista, Vin Diesel, Bradley Cooper, Michael Rooker,  Karen Gillan, Pom Klementieff, Elizabeth Debicki, Chris Sullivan, Sean Gunn, Sylvester Stallone, Kurt Russell"
    },
    {
        "id" : 16,
        "img" : "https://upload.wikimedia.org/wikipedia/en/f/f9/Spider-Man_Homecoming_poster.jpg",
        "title" : "Spider-Man: Homecoming",
        "usReleaseDate": 2017,
        "worldReleaseDate": 2017,
        "director" : "Jon Watts",
        "screenwriter" : "Jonathan Goldstein, John Francis Daley, Jon Watts, Christopher Ford, Chris McKenna, Erik Sommers",
        "producer" : "Kevin Feige, Amy Pascal",
        "phase" : 3,
        "plot":"Following the Battle of New York in 2012,[N 1] Adrian Toomes and his salvage company are contracted to clean up the city, but their operation is taken over by the Department of Damage Control (DODC), a partnership between Tony Stark and the U.S. government. Enraged at being driven out of business, Toomes persuades his employees to keep the Chitauri technology they have already scavenged and use it to create and sell advanced weapons, including a flying Vulture suit Toomes uses to steal Chitauri power cells.",
        "movieLength":133,
        "stars" : "Tom Holland, Michael Keaton, Jon Favreau, Gwyneth Paltrow,  Zendaya, Donald Glover, Jacob Batalon, Laura Harrier, Tony Revolori, Bokeem Woodbine, Tyne Daly,  Marisa Tomei,  Robert Downey Jr."
    },
    {
        "id" : 17,
        "img" : "https://upload.wikimedia.org/wikipedia/en/7/7d/Thor_Ragnarok_poster.jpg",
        "title" : "Thor: Ragnarok",
        "usReleaseDate": 2017,
        "worldReleaseDate": 2017,
        "director" : "Taika Waititi",
        "screenwriter" : "Eric Pearson, Craig Kyle, Christopher L. Yost",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"Two years after the battle of Sokovia,[N 1] Thor is imprisoned by the fire demon Surtur, who reveals that Thor's father Odin is no longer on Asgard. He explains that the realm will soon be destroyed during the prophesied Ragnarök, once Surtur unites his crown with the Eternal Flame that burns in Odin's vault. Thor frees himself, defeats Surtur and takes his crown, believing he has prevented Ragnarök.",
        "movieLength":130,
        "stars" : "Chris Hemsworth, Tom Hiddleston,  Cate Blanchett, Idris Elba, Jeff Goldblum, Tessa Thompson,  Karl Urban, Mark Ruffalo, Anthony Hopkins"
    },
    {
        "id" : 18,
        "img" : "https://upload.wikimedia.org/wikipedia/en/d/d6/Black_Panther_%28film%29_poster.jpg",
        "title" : "Black Panther",
        "usReleaseDate": 2018,
        "worldReleaseDate": 2018,
        "director" : "Ryan Coogler",
        "screenwriter" : "Ryan Coogler, Joe Robert Cole",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"Thousands of years ago, five African tribes war over a meteorite containing the metal vibranium. One warrior ingests a 'heart-shaped herb' affected by the metal and gains superhuman abilities, becoming the first 'Black Panther'. He unites all but the Jabari Tribe to form the nation of Wakanda. Over centuries, the Wakandans use the vibranium to develop advanced technology and isolate themselves from the world by posing as a Third World country. In 1992, Wakanda king T'Chaka visits his brother N'Jobu, who is working undercover in Oakland, California. T'Chaka accuses N'Jobu of assisting black-market arms dealer Ulysses Klaue with stealing vibranium from Wakanda. N'Jobu's partner reveals he is Zuri, another undercover Wakandan, and confirms T'Chaka's suspicions",
        "movieLength":134,
        "stars" : "Chadwick Boseman,Michael B. Jordan, Lupita Nyong'o, Danai Gurira, Martin Freeman, Daniel Kaluuya, Letitia Wright, Winston Duke, Angela Bassett, Forest Whitaker, Andy Serkis"
    },
    {
        "id" : 19,
        "img" : "https://upload.wikimedia.org/wikipedia/en/4/4d/Avengers_Infinity_War_poster.jpg",
        "title" : "Avengers: Infinity War",
        "usReleaseDate": 2018,
        "worldReleaseDate": 2018,
        "director" : "Anthony Russo, Joe Russo",
        "screenwriter" : "Christopher Markus, Stephen McFeely",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"Having acquired the Power Stone–one of the six Infinity Stones–from the planet Xandar, Thanos and his lieutenants: Ebony Maw, Cull Obsidian, Proxima Midnight, and Corvus Glaive, intercept the spaceship carrying the survivors of Asgard's destruction.[N 1] After subduing Thor, Thanos extracts the Space Stone from the Tesseract, overpowers the Hulk, and kills Loki. Thanos also kills Heimdall after he sends Hulk to Earth using the Bifröst. Thanos and his lieutenants leave, destroying the ship.",
        "movieLength":149,
        "stars" : "Robert Downey Jr., Chris Hemsworth, Mark Ruffalo, Chris Evans, Scarlett Johansson, Benedict Cumberbatch, Don Cheadle, Tom Holland, Chadwick Boseman, Paul Bettany, Elizabeth Olsen, Anthony Mackie, Sebastian Stan, Danai Gurira, Letitia Wright, Dave Bautista, Zoe Saldaña, Josh Brolin, Chris Pratt"
    },
    {
        "id" : 20,
        "img" : "https://upload.wikimedia.org/wikipedia/en/2/2c/Ant-Man_and_the_Wasp_poster.jpg",
        "title" : "Ant-Man and the Wasp",
        "usReleaseDate": 2018,
        "worldReleaseDate": 2018,
        "director" : "Peyton Reed",
        "screenwriter" : "Chris McKenna, Erik Sommers, Paul Rudd, Andrew Barrer, Gabriel Ferrari",
        "producer" : "Kevin Feige, Stephen Broussard",
        "phase" : 3,
        "plot":"Two years after Scott Lang was placed under house arrest due to his involvement with the Avengers, in violation of the Sokovia Accords,[N 1] Hank Pym and his daughter Hope van Dyne briefly manage to open a tunnel to the Quantum Realm. They believe Pym's wife Janet van Dyne might be trapped there after shrinking to sub-atomic levels in 1987. When he had previously visited the quantum realm, Lang had unknowingly become quantumly entangled with Janet, and now he receives an apparent message from her.",
        "movieLength":118,
        "stars" : "Paul Rudd, Evangeline Lilly, Michael Peña, Walton Goggins, Bobby Cannavale, Judy Greer, Tip 'T.I.' Harris, David Dastmalchian, Hannah John-Kamen, Abby Ryder Fortson, Randall Park, Michelle Pfeiffer, Laurence Fishburne, Michael Douglas"
    },
    {
        "id" : 21,
        "img" : "https://upload.wikimedia.org/wikipedia/en/4/4e/Captain_Marvel_%28film%29_poster.jpg",
        "title" : "Captain Marvel",
        "usReleaseDate": 2019,
        "worldReleaseDate": 2019,
        "director" : "Anna Boden, Ryan Fleck",
        "screenwriter" : "Anna Boden, Ryan Fleck, Geneva Robertson-Dworet",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"In 1995, on the Kree Empire's capital planet of Hala, Starforce member Vers suffers from amnesia and recurring nightmares involving an older woman. Yon-Rogg, her mentor and commander, trains Vers to control her abilities, while the Supreme Intelligence, the artificial intelligence that rules the Kree, urges her to keep her emotions in check.",
        "movieLength":124,
        "stars" : "Brie Larson, Samuel L. Jackson, Ben Mendelsohn, Djimon Hounsou, Lee Pace, Lashana Lynch, Gemma Chan, Annette Bening, Clark Gregg, Jude Law"
    },
    {
        "id" : 22,
        "img" : "https://upload.wikimedia.org/wikipedia/en/0/0d/Avengers_Endgame_poster.jpg",
        "title" : "Avengers: Endgame",
        "usReleaseDate": 2019,
        "worldReleaseDate": 2019,
        "director" : "Anthony Russo, Joe Russo",
        "screenwriter" : "Christopher Markus, Stephen McFeely",
        "producer" : "Kevin Feige",
        "phase" : 3,
        "plot":"In 2018, twenty-three days after Thanos killed half of all life in the universe,[N 1] Carol Danvers rescues Tony Stark and Nebula from deep space and they reunite with the remaining Avengers—Bruce Banner, Steve Rogers, Thor, Natasha Romanoff, and James Rhodes—and Rocket on Earth. Locating Thanos on an uninhabited planet, they plan to use the Infinity Stones to reverse his actions, but discover Thanos has already destroyed them to prevent further use. Enraged, Thor decapitates Thanos.",
        "movieLength":181,
        "stars" : "Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, Josh Brolin"
    },
    {
        "id" : 23,
        "img" : "https://upload.wikimedia.org/wikipedia/en/b/bd/Spider-Man_Far_From_Home_poster.jpg",
        "title" : "Spider-Man: Far From Home",
        "usReleaseDate": 2019,
        "worldReleaseDate": 2019,
        "director" : "Jon Watts",
        "screenwriter" : "Chris McKenna, Erik Sommers",
        "producer" : "Kevin Feige, Amy Pascal",
        "phase" : 3,
        "plot":"In Ixtenco, Mexico, Nick Fury and Maria Hill investigate an unnatural storm and encounter the Earth Elemental. Quentin Beck, a super-powered individual, arrives to defeat the creature. Beck subsequently defeats the Elemental and is recruited by Fury and Hill. In New York City, the Midtown School of Science and Technology completes its year, which was restarted to accommodate the students who previously disintegrated five years earlier as a result of Thanos' actions.[N 1] They had reappeared un-aged, thanks to the actions of the Avengers.[N 2] The school organizes a two-week summer field trip to Europe, where Peter Parker—who is still mourning the death of his mentor Tony Stark—plans to reveal to classmate MJ his attraction to her. Happy Hogan informs Parker that Fury intends to contact him, but Parker ignores Fury's phone call.",
        "movieLength":129,
        "stars" : "Tom Holland, Samuel L. Jackson, Zendaya, Cobie Smulders, Jon Favreau, J. B. Smoove, Jacob Batalon, Martin Starr, Marisa Tomei, Jake Gyllenhaal"
    },
    {
        "id" : 24,
        "img" : "https://upload.wikimedia.org/wikipedia/en/e/e9/Black_Widow_%282021_film%29_poster.jpg",
        "title" : "Black Widow",
        "usReleaseDate": 2021,
        "worldReleaseDate": 2021,
        "director" : "Cate Shortland",
        "screenwriter" : "Eric Pearson",
        "producer" : "Kevin Feige",
        "phase" : 4,
        "plot":"In Ixtenco, Mexico, Nick Fury and Maria Hill investigate an unnatural storm and encounter the Earth Elemental. Quentin Beck, a super-powered individual, arrives to defeat the creature. Beck subsequently defeats the Elemental and is recruited by Fury and Hill. In New York City, the Midtown School of Science and Technology completes its year, which was restarted to accommodate the students who previously disintegrated five years earlier as a result of Thanos' actions.[N 1] They had reappeared un-aged, thanks to the actions of the Avengers.[N 2] The school organizes a two-week summer field trip to Europe, where Peter Parker—who is still mourning the death of his mentor Tony Stark—plans to reveal to classmate MJ his attraction to her. Happy Hogan informs Parker that Fury intends to contact him, but Parker ignores Fury's phone call.",
        "movieLength":134,
        "stars" : "Scarlett Johansson, Florence Pugh, David Harbour, O-T Fagbenle, Olga Kurylenko, William Hurt, Ray Winstone, Rachel Weisz"
    },
    {
        "id" : 25,
        "img" : "https://upload.wikimedia.org/wikipedia/en/7/74/Shang-Chi_and_the_Legend_of_the_Ten_Rings_poster.jpeg",
        "title" : "Shang-Chi and the Legend of the Ten Rings",
        "usReleaseDate": 2021,
        "worldReleaseDate": 2021,
        "director" : "Destin Daniel Cretton",
        "screenwriter" : "Dave Callaham, Destin Daniel Cretton, Andrew Lanham",
        "producer" : "Kevin Feige, Jonathan Schwartz",
        "phase" : 4,
        "plot":"Around a thousand years ago, Xu Wenwu discovers the mystical ten rings which grant immortality and godly powers. He establishes the Ten Rings organization, conquering kingdoms and toppling governments throughout history. In 1996, Wenwu searches for Ta Lo, a village said to harbor mythical beasts. He travels through a magical forest to the village entrance but is stopped by a guardian, Ying Li. The two fall in love, and when the Ta Lo villagers reject Wenwu, Li chooses to leave with him. They marry and have two children, Shang-Chi and Xialing. Wenwu abandons his organization and locks away the ten rings.",
        "movieLength":134,
        "stars" : "Simu Liu, Awkwafina, Meng'er Zhang, Fala Chen, Florian Munteanu, Benedict Wong, Michelle Yeoh, Ben Kingsley, Tony Leung"
    },
    {
        "id" : 26,
        "img" : "https://upload.wikimedia.org/wikipedia/en/9/9b/Eternals_%28film%29_poster.jpeg",
        "title" : "Eternals",
        "usReleaseDate": 2021,
        "worldReleaseDate": 2021,
        "director" : "Chloé Zhao",
        "screenwriter" : "Chloé Zhao, Patrick Burleigh, Ryan Firpo, Kaz Firpo",
        "producer" : "Kevin Feige, Nate Moore",
        "phase" : 4,
        "plot":"In 5000 BC, ten superpowered Eternals—Ajak, Sersi, Ikaris, Kingo, Sprite, Phastos, Makkari, Druig, Gilgamesh, and Thena—are sent by the Celestial Arishem to Earth on their starship, the Domo, to exterminate the invasive Deviants. The last Deviants are apparently killed in 1521, when the group's opinions differ over their continued responsibilities and relationship with humankind. Over the next five hundred years they mostly live apart, waiting for Arishem to tell them that they can leave.",
        "movieLength":134,
        "stars" : "Gemma Chan, Richard Madden, Kumail Nanjiani, Lia McHugh, Brian Tyree Henry, Lauren Ridloff, Barry Keoghan, Don Lee, Harish Patel, Kit Harington, Salma Hayek, Angelina Jolie"
    },
    {
        "id" : 27,
        "img" : "https://upload.wikimedia.org/wikipedia/en/0/00/Spider-Man_No_Way_Home_poster.jpg",
        "title" : "Spider-Man: No Way Home",
        "usReleaseDate": 2021,
        "worldReleaseDate": 2021,
        "director" : "Jon Watts",
        "screenwriter" : "Chris McKenna, Erik Sommers",
        "producer" : "Kevin Feige, Amy Pascal",
        "phase" : 4,
        "plot":"After Quentin Beck frames Peter Parker for murder and reveals his identity as Spider-Man,[N 1] Parker, his girlfriend MJ, best friend Ned Leeds, and aunt May are interrogated by the Department of Damage Control. Lawyer Matt Murdock gets Parker's charges dropped, but the group grapples with negative publicity. After Parker, MJ, and Ned's MIT applications are rejected, Parker goes to the New York Sanctum to ask Stephen Strange for help. Strange casts a spell that would make everyone forget Parker is Spider-Man, but it is corrupted when Parker repeatedly requests alterations to let his loved ones retain their memories. Strange contains the spell to stop it and makes Parker leave.",
        "movieLength":134,
        "stars" : "Tom Holland, Zendaya, Benedict Cumberbatch, Jacob Batalon, Jon Favreau, Jamie Foxx, Willem Dafoe, Alfred Molina, Benedict Wong, Tony Revolori, Marisa Tomei, Andrew Garfield, Tobey Maguire"
    }
]